[
 {
  "content": "\n\n# Heading One\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/bcXzSYUjchU?si=eFCMfVKvK5nV-0dm\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n",
  "published": false,
  "snippet": "",
  "tags": [
   "Music"
  ],
  "time": 1703837227542,
  "title": "Praise instrumentals",
  "id": 1703837227542
 },
 {
  "content": "\n\n- Be an advocate for the faith, proving all things with patience and diligence.\n- Continue to follow the spirit when playing music. \n\n\n",
  "published": false,
  "snippet": "",
  "tags": [],
  "time": 1704689080569,
  "title": "Expansion",
  "id": 1704689080569
 },
 {
  "content": "\n\n# Where the Stars are Arcs\n\n### A dream, in the early morning hours of Oct 14th, 2024\n\nI sat in my sparsely appointed ground floor, neutral-beige-colored, upper West Side apartment, and noticed. Looking around, I saw various aspects. I wondered if there was a north-facing window. There was, a small one.\n\nMy apartment had windows on 3 sides, then, it seemed, although the north window opened up into a courtyard between the rows of buildings that people called home.\n\nI wandered westward from the window to the northwest corner. I noticed a door, whose hinges were welded steel gate hinges, creating a large gap that could not be closed. In fact, I could squeeze through the gate-door without needing to open it.\n\nI turned the corner, and there I saw the landlord, in the courtyard. We spoke briefly, and he let me know he was about to leave on an expidition to the Himalayas, and I'd be welcome to join. I agreed to go, and shortly met my traveling companions, a young man and a young woman. We engaged in pleasantries, as we walked westward towards the water's edge.\n\nWe piled into a waiting rowboat, pointed at both ends, and without a word, the landlord picked up oars lying camouflaged on the floor of the boat.\n\nWe rowed westward, down the stream, across the river and through the sky.\n\n## The Himalayas\n\nTurning a bend in the stream, we arrived at the top of a Himalayan plateau. There was lush greenery, whether indoor or outdoor, I could not tell. Through the trees, I could observe the vast expanse of snow-capped peaks. We had arrived, and night was quickly falling. The landlord docked the boat, and we stepped off. Dozens of people milled about, going from one place to another at camp. There were 3 wooden cabins on the far side of the river. It seemed as if we were at the origin of the river, so that it was possible to reach the cabins by a 5-minute walk around the source of the river.\n\nSuddenly I looked up at the sky. The stars were arcs, sweeping across the sky a finger's width across, as if an hour of time was always passing concurrently.\n\nThe landlord addressed us at once: saying that in 9 days he would be here to return us home, and telling us to enjoy our stay. My traveling companions and the landlord vanished into the night, and I was left alone.\n\n## The People\n\nI wandered down the north edge of the river, past the cabins, and found a small congregation of people. There might have been a fire. I sensed a blind man and his sighted companion behind me, and sat down on their legs as there was no bench space available. They laughed at the interaction and rubbed my back caringly. We talked for what seemed like tens of minutes, but could have been an hour.\n\nSuddenly, I saw a face I recognized approaching, \"M\", an acquaintance from long ago in the city, was walking over. I stood up and we embraced joyfully. I didn't want the embrace to end, but she pulled away after a moment.\n",
  "published": false,
  "snippet": "",
  "tags": [],
  "time": 1728907478945,
  "title": "Where the Stars are Arcs",
  "id": 1728907478945
 }
]